dylanmccavitt/esp32/sdkconfig.defaults
# -----------------------------------------------------------------------------
# fluid_box_3d — Waveshare ESP32-S3-Touch-LCD-1.54
# ESP-IDF 6.0.2 target: ESP32-S3R8, 8 MB octal PSRAM, 16 MB flash.
# -----------------------------------------------------------------------------

# Pin the chip target: without this a fresh checkout configures for plain
# ESP32 and board.cpp fails on S3-only GPIO numbers.
CONFIG_IDF_TARGET="esp32s3"

# CPU: run at 240 MHz
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Optimize for performance (-O2)
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Flash: 16 MB, QIO at 80 MHz
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Octal PSRAM at 80 MHz, integrated into malloc
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# Scheduler and cache geometry for stable high-rate sensor/render tasks
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# A persistent peripheral fault must halt for physical/ROM recovery, not loop.
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y

# Primary console: USB Serial/JTAG
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
